Merge upstream dev into PR 10757
